bluekitchen/btstack/port/stm32-f4discovery-csr8x11/doc/STMicro/STM32G071.svd
      </registers>
    </peripheral>
    <peripheral>
      <name>DMA</name>
      <description>DMA controller</description>
      <groupName>DMA</groupName>
      <baseAddress>0x40020000</baseAddress>
      <addressBlock>
        <offset>0x0</offset>
        <size>0x400</size>
        <usage>registers</usage>
      </addressBlock>
      <interrupt>
        <name>DMA_Channel1</name>
        <description>DMA channel 1 interrupt</description>
        <value>9</value>
      </interrupt>
      <interrupt>
        <name>DMA_Channel2_3</name>
        <description>DMA channel 2 &amp; 3 interrupts</description>
        <value>10</value>
      </interrupt>
      <registers>
        <register>
          <name>ISR</name>
          <displayName>ISR</displayName>
          <description>low interrupt status register</description>
          <addressOffset>0x0</addressOffset>
          <size>0x20</size>
          <access>read-only</access>
          <resetValue>0x00000000</resetValue>
          <fields>
			  <field>
				<name>GIF1</name>
				<description>global interrupt flag for channel 1</description>
				<bitOffset>0</bitOffset>
				<bitWidth>1</bitWidth>
				<access>read-only</access>
			  </field>
			  <field>
				<name>TCIF1</name>
				<description>transfer complete (TC) flag for channel 1</description>
				<bitOffset>1</bitOffset>
				<bitWidth>1</bitWidth>
				<access>read-only</access>
			  </field>
			  <field>
				<name>HTIF1</name>
				<description>half transfer (HT) flag for channel 1</description>
				<bitOffset>2</bitOffset>
				<bitWidth>1</bitWidth>
				<access>read-only</access>
			  </field>
			  <field>
				<name>TEIF1</name>
				<description>transfer error (TE) flag for channel 1</description>
				<bitOffset>3</bitOffset>
				<bitWidth>1</bitWidth>
				<access>read-only</access>
			  </field>
			  <field>
				<name>GIF2</name>
				<description>global interrupt flag for channel 2</description>
				<bitOffset>4</bitOffset>
				<bitWidth>1</bitWidth>
				<access>read-only</access>
			  </field>
			  <field>
				<name>TCIF2</name>
				<description>transfer complete (TC) flag for channel 2</description>
				<bitOffset>5</bitOffset>
				<bitWidth>1</bitWidth>
				<access>read-only</access>
			  </field>
			  <field>
				<name>HTIF2</name>
				<description>half transfer (HT) flag for channel 2</description>
				<bitOffset>6</bitOffset>
				<bitWidth>1</bitWidth>
				<access>read-only</access>
			  </field>
			  <field>
				<name>TEIF2</name>
				<description>transfer error (TE) flag for channel 2</description>
				<bitOffset>7</bitOffset>
				<bitWidth>1</bitWidth>
				<access>read-only</access>
			  </field>
			  <field>
				<name>GIF3</name>
				<description>global interrupt flag for channel 3</description>
				<bitOffset>8</bitOffset>
				<bitWidth>1</bitWidth>
				<access>read-only</access>
			  </field>
			  <field>
				<name>TCIF3</name>
				<description>transfer complete (TC) flag for channel 3</description>
				<bitOffset>9</bitOffset>
				<bitWidth>1</bitWidth>
				<access>read-only</access>
			  </field>
			  <field>
				<name>HTIF3</name>
				<description>half transfer (HT) flag for channel 3</description>
				<bitOffset>10</bitOffset>
				<bitWidth>1</bitWidth>
				<access>read-only</access>
			  </field>
			  <field>
				<name>TEIF3</name>
				<description>transfer error (TE) flag for channel 3</description>
				<bitOffset>11</bitOffset>
				<bitWidth>1</bitWidth>
				<access>read-only</access>
			  </field>
			  <field>
				<name>GIF4</name>
				<description>global interrupt flag for channel 4</description>
				<bitOffset>12</bitOffset>
				<bitWidth>1</bitWidth>
				<access>read-only</access>
			  </field>
			  <field>
				<name>TCIF4</name>
				<description>transfer complete (TC) flag for channel 4</description>
				<bitOffset>13</bitOffset>
				<bitWidth>1</bitWidth>
				<access>read-only</access>
			  </field>
			  <field>
				<name>HTIF4</name>
				<description>half transfer (HT) flag for channel 4</description>
				<bitOffset>14</bitOffset>
				<bitWidth>1</bitWidth>
				<access>read-only</access>
			  </field>
			  <field>
				<name>TEIF4</name>
				<description>transfer error (TE) flag for channel 4</description>
				<bitOffset>15</bitOffset>
				<bitWidth>1</bitWidth>
				<access>read-only</access>
			  </field>
			  <field>
				<name>GIF5</name>
				<description>global interrupt flag for channel 5</description>
				<bitOffset>16</bitOffset>
				<bitWidth>1</bitWidth>
				<access>read-only</access>
			  </field>
			  <field>
				<name>TCIF5</name>
				<description>transfer complete (TC) flag for channel 5</description>
				<bitOffset>17</bitOffset>
				<bitWidth>1</bitWidth>
				<access>read-only</access>
			  </field>
			  <field>
				<name>HTIF5</name>
				<description>half transfer (HT) flag for channel 5</description>
				<bitOffset>18</bitOffset>
				<bitWidth>1</bitWidth>
				<access>read-only</access>
			  </field>
			  <field>
				<name>TEIF5</name>
				<description>transfer error (TE) flag for channel 5</description>
				<bitOffset>19</bitOffset>
				<bitWidth>1</bitWidth>
				<access>read-only</access>
			  </field>
			  <field>
				<name>GIF6</name>
				<description>global interrupt flag for channel 6</description>
				<bitOffset>20</bitOffset>
				<bitWidth>1</bitWidth>
				<access>read-only</access>
			  </field>
			  <field>
				<name>TCIF6</name>
				<description>transfer complete (TC) flag for channel 6</description>
				<bitOffset>21</bitOffset>
				<bitWidth>1</bitWidth>
				<access>read-only</access>
			  </field>
			  <field>
				<name>HTIF6</name>
				<description>half transfer (HT) flag for channel 6</description>
				<bitOffset>22</bitOffset>
				<bitWidth>1</bitWidth>
				<access>read-only</access>
			  </field>
			  <field>
				<name>TEIF6</name>
				<description>transfer error (TE) flag for channel 6</description>
				<bitOffset>23</bitOffset>
				<bitWidth>1</bitWidth>
				<access>read-only</access>
			  </field>
			  <field>
				<name>GIF7</name>
				<description>global interrupt flag for channel 7</description>
				<bitOffset>24</bitOffset>
				<bitWidth>1</bitWidth>
				<access>read-only</access>
			  </field>
			  <field>
				<name>TCIF7</name>
				<description>transfer complete (TC) flag for channel 7</description>
				<bitOffset>25</bitOffset>
				<bitWidth>1</bitWidth>
				<access>read-only</access>
			  </field>
			  <field>
				<name>HTIF7</name>
				<description>half transfer (HT) flag for channel 7</description>
				<bitOffset>26</bitOffset>
				<bitWidth>1</bitWidth>
				<access>read-only</access>
			  </field>
			  <field>
				<name>TEIF7</name>
				<description>transfer error (TE) flag for channel 7</description>
				<bitOffset>27</bitOffset>
				<bitWidth>1</bitWidth>
				<access>read-only</access>
			  </field>
          </fields>
        </register>
        <register>
          <name>IFCR</name>
          <displayName>IFCR</displayName>
          <description>high interrupt status register</description>
          <addressOffset>0x4</addressOffset>
          <size>0x20</size>
          <access>read-only</access>
          <resetValue>0x00000000</resetValue>
          <fields>
            <field>
              <name>CGIF0</name>
              <description>Channel global interrupt
              flag</description>
              <bitOffset>0</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>CTCIF1</name>
              <description>Channel transfer complete
              flag</description>
              <bitOffset>1</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>CHTIF2</name>
              <description>Channel half transfer flag</description>
              <bitOffset>2</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>CTEIF3</name>
              <description>Channel transfer error
              flag</description>
              <bitOffset>3</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>CGIF4</name>
              <description>Channel global interrupt
              flag</description>
              <bitOffset>4</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>CTCIF5</name>
              <description>Channel transfer complete
              flag</description>
              <bitOffset>5</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>CHTIF6</name>
              <description>Channel half transfer flag</description>
              <bitOffset>6</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>CTEIF7</name>
              <description>Channel transfer error
              flag</description>
              <bitOffset>7</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>CGIF8</name>
              <description>Channel global interrupt
              flag</description>
              <bitOffset>8</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>CTCIF9</name>
              <description>Channel transfer complete
              flag</description>
              <bitOffset>9</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>CHTIF10</name>
              <description>Channel half transfer flag</description>
              <bitOffset>10</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>CTEIF11</name>
              <description>Channel transfer error
              flag</description>
              <bitOffset>11</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>CGIF12</name>
              <description>Channel global interrupt
              flag</description>
              <bitOffset>12</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>CTCIF13</name>
              <description>Channel transfer complete
              flag</description>
              <bitOffset>13</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>CHTIF14</name>
              <description>Channel half transfer flag</description>
              <bitOffset>14</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>CTEIF15</name>
              <description>Channel transfer error
              flag</description>
              <bitOffset>15</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>CGIF16</name>
              <description>Channel global interrupt
              flag</description>
              <bitOffset>16</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>CTCIF17</name>
              <description>Channel transfer complete
              flag</description>
              <bitOffset>17</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>CHTIF18</name>
              <description>Channel half transfer flag</description>
              <bitOffset>18</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>CTEIF19</name>
              <description>Channel transfer error
              flag</description>
              <bitOffset>19</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>CGIF20</name>
              <description>Channel global interrupt
              flag</description>
              <bitOffset>20</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>CTCIF21</name>
              <description>Channel transfer complete
              flag</description>
              <bitOffset>21</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>CHTIF22</name>
              <description>Channel half transfer flag</description>
              <bitOffset>22</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>CTEIF23</name>
              <description>Channel transfer error
              flag</description>
              <bitOffset>23</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>CGIF24</name>
              <description>Channel global interrupt
              flag</description>
              <bitOffset>24</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>CTCIF25</name>
              <description>Channel transfer complete
              flag</description>
              <bitOffset>25</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>CHTIF26</name>
              <description>Channel half transfer flag</description>
              <bitOffset>26</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>CTEIF27</name>
              <description>Channel transfer error
              flag</description>
              <bitOffset>27</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
          </fields>
        </register>
        <register>
          <name>CCR1</name>
          <displayName>CCR1</displayName>
          <description>DMA channel x configuration
          register</description>
          <addressOffset>0x8</addressOffset>
          <size>0x20</size>
          <access>read-write</access>
          <resetValue>0x00000000</resetValue>
          <fields>
            <field>
              <name>EN</name>
              <description>Channel enable</description>
              <bitOffset>0</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>TCIE</name>
              <description>Transfer complete interrupt
              enable</description>
              <bitOffset>1</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>HTIE</name>
              <description>Half transfer interrupt
              enable</description>
              <bitOffset>2</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>TEIE</name>
              <description>Transfer error interrupt
              enable</description>
              <bitOffset>3</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>DIR</name>
              <description>Data transfer direction</description>
              <bitOffset>4</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>CIRC</name>
              <description>Circular mode</description>
              <bitOffset>5</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>PINC</name>
              <description>Peripheral increment mode</description>
              <bitOffset>6</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>MINC</name>
              <description>Memory increment mode</description>
              <bitOffset>7</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>PSIZE</name>
              <description>Peripheral size</description>
              <bitOffset>8</bitOffset>
              <bitWidth>2</bitWidth>
            </field>
            <field>
              <name>MSIZE</name>
              <description>Memory size</description>
              <bitOffset>10</bitOffset>
              <bitWidth>2</bitWidth>
            </field>
            <field>
              <name>PL</name>
              <description>Channel priority level</description>
              <bitOffset>12</bitOffset>
              <bitWidth>2</bitWidth>
            </field>
            <field>
              <name>MEM2MEM</name>
              <description>Memory to memory mode</description>
              <bitOffset>14</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
          </fields>
        </register>
        <register>
          <name>CCR2</name>
          <displayName>CCR2</displayName>
          <description>DMA channel x configuration
          register</description>
          <addressOffset>0x1C</addressOffset>
          <size>0x20</size>
          <access>read-write</access>
          <resetValue>0x00000000</resetValue>
          <fields>
            <field>
              <name>EN</name>
              <description>Channel enable</description>
              <bitOffset>0</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>TCIE</name>
              <description>Transfer complete interrupt
              enable</description>
              <bitOffset>1</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>HTIE</name>
              <description>Half transfer interrupt
              enable</description>
              <bitOffset>2</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>TEIE</name>
              <description>Transfer error interrupt
              enable</description>
              <bitOffset>3</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>DIR</name>
              <description>Data transfer direction</description>
              <bitOffset>4</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>CIRC</name>
              <description>Circular mode</description>
              <bitOffset>5</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>PINC</name>
              <description>Peripheral increment mode</description>
              <bitOffset>6</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>MINC</name>
              <description>Memory increment mode</description>
              <bitOffset>7</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>PSIZE</name>
              <description>Peripheral size</description>
              <bitOffset>8</bitOffset>
              <bitWidth>2</bitWidth>
            </field>
            <field>
              <name>MSIZE</name>
              <description>Memory size</description>
              <bitOffset>10</bitOffset>
              <bitWidth>2</bitWidth>
            </field>
            <field>
              <name>PL</name>
              <description>Channel priority level</description>
              <bitOffset>12</bitOffset>
              <bitWidth>2</bitWidth>
            </field>
            <field>
              <name>MEM2MEM</name>
              <description>Memory to memory mode</description>
              <bitOffset>14</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
          </fields>
        </register>
        <register>
          <name>CCR3</name>
          <displayName>CCR3</displayName>
          <description>DMA channel x configuration
          register</description>
          <addressOffset>0x30</addressOffset>
          <size>0x20</size>
          <access>read-write</access>
          <resetValue>0x00000000</resetValue>
          <fields>
            <field>
              <name>EN</name>
              <description>Channel enable</description>
              <bitOffset>0</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>TCIE</name>
              <description>Transfer complete interrupt
              enable</description>
              <bitOffset>1</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>HTIE</name>
              <description>Half transfer interrupt
              enable</description>
              <bitOffset>2</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>TEIE</name>
              <description>Transfer error interrupt
              enable</description>
              <bitOffset>3</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>DIR</name>
              <description>Data transfer direction</description>
              <bitOffset>4</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>CIRC</name>
              <description>Circular mode</description>
              <bitOffset>5</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>PINC</name>
              <description>Peripheral increment mode</description>
              <bitOffset>6</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>MINC</name>
              <description>Memory increment mode</description>
              <bitOffset>7</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>PSIZE</name>
              <description>Peripheral size</description>
              <bitOffset>8</bitOffset>
              <bitWidth>2</bitWidth>
            </field>
            <field>
              <name>MSIZE</name>
              <description>Memory size</description>
              <bitOffset>10</bitOffset>
              <bitWidth>2</bitWidth>
            </field>
            <field>
              <name>PL</name>
              <description>Channel priority level</description>
              <bitOffset>12</bitOffset>
              <bitWidth>2</bitWidth>
            </field>
            <field>
              <name>MEM2MEM</name>
              <description>Memory to memory mode</description>
              <bitOffset>14</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
          </fields>
        </register>
